# UpdaterId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterId Class
Members See Also
---
A unique identifier of an Updater
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class UpdaterId : IDisposable
```

Visual Basic
---
```text
Public Class UpdaterId _
	Implements IDisposable
```

Visual C++
---
```text
public ref class UpdaterId : IDisposable
```

# Remarks
UpdaterID used as a key to register and unregister Updaters and UpdateTriggers in Revit application
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..UpdaterId
# See Also
UpdaterId Members
Autodesk.Revit.DB Namespace